Nafihahmd/esp32_nimble_oad_distributor/main/main.c
/*
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include "esp_log.h"
#include "nvs_flash.h"
/* BLE */
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/util/util.h"
#include "console/console.h"
#include "services/gap/ble_svc_gap.h"
#include "blecent.h"
#if MYNEWT_VAL(BLE_GATT_CACHING)
#include "host/ble_esp_gattc_cache.h"
#endif
/* OAD */
#include "ble_oad.h"

#if CONFIG_EXAMPLE_USE_CI_ADDRESS
#ifdef CONFIG_IDF_TARGET_ESP32
#define TEST_CI_ADDRESS_CHIP_OFFSET (0)
#elif CONFIG_IDF_TARGET_ESP32C2
#define TEST_CI_ADDRESS_CHIP_OFFSET (1)
#elif CONFIG_IDF_TARGET_ESP32C3
#define TEST_CI_ADDRESS_CHIP_OFFSET (2)
#elif CONFIG_IDF_TARGET_ESP32C6
#define TEST_CI_ADDRESS_CHIP_OFFSET (3)
#elif CONFIG_IDF_TARGET_ESP32C5
#define TEST_CI_ADDRESS_CHIP_OFFSET (4)
#elif CONFIG_IDF_TARGET_ESP32H2
#define TEST_CI_ADDRESS_CHIP_OFFSET (5)
#elif CONFIG_IDF_TARGET_ESP32P4
#define TEST_CI_ADDRESS_CHIP_OFFSET (6)
#elif CONFIG_IDF_TARGET_ESP32S3
#define TEST_CI_ADDRESS_CHIP_OFFSET (7)
#elif CONFIG_IDF_TARGET_ESP32C61
#define TEST_CI_ADDRESS_CHIP_OFFSET (8)
#endif
#endif

#if MYNEWT_VAL(BLE_GATTC)
/*** The UUID of the service containing the subscribable characteristic ***/
static const ble_uuid_t * remote_svc_uuid =
    BLE_UUID128_DECLARE(0xf0, 0x00, 0xff, 0xc0, 0x04, 0x51, 0x40, 0x00,
                     	0xb0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00);

/*** The UUID of the subscribable chatacteristic ***/
static const ble_uuid_t * remote_chr_uuid =
    BLE_UUID128_DECLARE(0xf0, 0x00, 0xff, 0xc1, 0x04, 0x51, 0x40, 0x00,
                     	0xb0, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00);
#endif

static const char *tag = "app_main";
static int blecent_gap_event(struct ble_gap_event *event, void *arg);

#if MYNEWT_VAL(BLE_EATT_CHAN_NUM) > 0
static uint16_t cids[MYNEWT_VAL(BLE_EATT_CHAN_NUM)];
static uint16_t bearers;
#endif

void ble_store_config_init(void);

//-------------------------------------------------
// Global variables and definitions
//-------------------------------------------------
uint8_t image_identify[] = {
    0x3D,0xB8,0xF3,0x96,
    0x00,0x00,0x00,0x00,
    0x00,0x01,
    0x00,0x00,
    0x00,0xB0,0x03,0x00,
    0x00,0x00,0x00,0x00,
    0x02,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00
};
/**
 * Send command for the target to restart to the new firmware
 */
static void send_finish_oad(uint16_t conn_handle)
{
    const struct peer *peer = peer_find(conn_handle);
    const struct peer_chr *ctrl_chr;

    ctrl_chr = peer_chr_find_uuid(peer,
                                  &oad_service_uuid.u,
                                  &oad_ctrl_uuid.u);

    if (ctrl_chr == NULL) {
        ESP_LOGE(tag, "OAD Control characteristic not found");
        return;
    }

    uint8_t cmd = CMD_FINISH_OAD;

    int rc = ble_gattc_write_no_rsp_flat(conn_handle,
                                         ctrl_chr->chr.val_handle,
                                         &cmd,
                                         sizeof(cmd));

    ESP_LOGI(tag, "OAD Finished rc=%d", rc);
}
/**
 * Build OAD blocks from the firmware.bin file
 */
static uint16_t build_oad_block(uint32_t block_num,
                                uint8_t *tx_buf)
{
    uint32_t payload_size = g_block_size - 4;

    uint32_t offset = block_num * payload_size;

    uint32_t remaining =
        (offset < g_image_size)
            ? (g_image_size - offset)
            : 0;

    uint32_t data_len =
        (remaining > payload_size)
            ? payload_size
            : remaining;

    /* Block number */
    tx_buf[0] = (uint8_t)(block_num);
    tx_buf[1] = (uint8_t)(block_num >> 8);
    tx_buf[2] = (uint8_t)(block_num >> 16);
    tx_buf[3] = (uint8_t)(block_num >> 24);

    memcpy(&tx_buf[4],
           &g_image_data[offset],
           data_len);

    /* Pad last block with FF */
    if (data_len < payload_size) {

        memset(&tx_buf[4 + data_len],
               0xFF,
               payload_size - data_len);
    }
    
    if (block_num>1022){
        ESP_LOGI(tag,
         "block=%lu offset=%lu remaining=%lu data_len=%lu",
         block_num,
         offset,
         remaining,
         data_len);
    }

    return g_block_size;
}
/**
 * Send OAD blocks as requested by target
 */
static uint8_t g_tx_block[244];

static void send_oad_block(uint16_t conn_handle,
                           uint32_t block_num)
{
    const struct peer *peer;
    const struct peer_chr *block_chr;

    peer = peer_find(conn_handle);

    block_chr = peer_chr_find_uuid(peer,
                                   &oad_service_uuid.u,
                                   &oad_block_uuid.u);

    if (block_chr == NULL) {
        ESP_LOGE(tag,
                 "OAD Block characteristic not found");
        return;
    }

    uint16_t tx_len =
        build_oad_block(block_num,
                        g_tx_block);

    ESP_LOGD(tag,
             "TX block=%lu offset=%lu len=%u first8=%02x%02x%02x%02x%02x%02x%02x%02x",
             (unsigned long)block_num,
             (unsigned long)(block_num * (g_block_size - 4)),
             tx_len - 4,
             g_tx_block[0],
             g_tx_block[1],
             g_tx_block[2],
             g_tx_block[3],
             g_tx_block[4],
             g_tx_block[5],
             g_tx_block[6],
             g_tx_block[7]);

    int rc =
        ble_gattc_write_no_rsp_flat(conn_handle,
                                    block_chr->chr.val_handle,
                                    g_tx_block,
                                    tx_len);

    if (rc != 0) {
        ESP_LOGE(tag,
                 "Failed to send block %lu rc=%d",
                 (unsigned long)block_num,
                 rc);
    }
}
/**
 * Send OAD start command to target. The target will respond
 * by requesting block number.
 */
static void send_start_oad(uint16_t conn_handle)
{
    const struct peer *peer = peer_find(conn_handle);
    const struct peer_chr *ctrl_chr;

    ctrl_chr = peer_chr_find_uuid(peer,
                                  &oad_service_uuid.u,
                                  &oad_ctrl_uuid.u);

    if (ctrl_chr == NULL) {
        ESP_LOGE(tag, "OAD Control characteristic not found");
        return;
    }

    uint8_t cmd = CMD_START_OAD;

    ESP_LOGI(tag, "Sending START_OAD");

