Nafihahmd/esp32_nimble_oad_distributor/main/main.c
    int rc = ble_gattc_write_no_rsp_flat(conn_handle,
                                         ctrl_chr->chr.val_handle,
                                         &cmd,
                                         sizeof(cmd));

    if (rc != 0) {
        ESP_LOGE(tag,
                 "Failed to send START_OAD rc=%d",
                 rc);
    }
}
/**
 * Send Image identification payload to target
 */
static void send_image_identify(uint16_t conn_handle)
{
    const struct peer *peer = peer_find(conn_handle);
    const struct peer_chr *img_chr;

    img_chr = peer_chr_find_uuid(peer,
                                 &oad_service_uuid.u,
                                 &oad_img_uuid.u);

    if (img_chr == NULL) {
        ESP_LOGE(tag, "OAD Image Identify characteristic not found");
        return;
    }

    ESP_LOGI(tag, "Sending Image Identify");
    ESP_LOG_BUFFER_HEX(tag,
                       image_identify,
                       sizeof(image_identify));

    int rc = ble_gattc_write_flat(conn_handle,
                                  img_chr->chr.val_handle,
                                  image_identify,
                                  sizeof(image_identify),
                                  NULL,
                                  NULL);

    if (rc != 0) {
        ESP_LOGE(tag,
                 "Failed to send Image Identify rc=%d",
                 rc);
    }
}
/**
 * Handle Block request send by Target
 */
static void handle_block_request(uint16_t conn_handle, uint8_t *data, uint16_t len)
{
    uint8_t status = data[1];

    if (status != 0) {
        ESP_LOGW(tag,
                 "Target rejected previous block status=%u",
                 status);

        return;
    }

    uint32_t block_num =
          ((uint32_t)data[2])
        | ((uint32_t)data[3] << 8)
        | ((uint32_t)data[4] << 16)
        | ((uint32_t)data[5] << 24);

    ESP_LOGI(tag,
             "Request Block %lu",
             (unsigned long)block_num);

    send_oad_block(conn_handle, block_num);
}
#if MYNEWT_VAL(BLE_GATTC)
static int
oad_on_mtu_exchanged(uint16_t conn_handle,
                     const struct ble_gatt_error *error,
                     uint16_t mtu, void *arg)
{
    ESP_LOGI(tag, "MTU exchange complete: status=%d mtu=%d", error->status, mtu);

    if (error->status != 0) {
        MODLOG_DFLT(ERROR, "MTU exchange failed, aborting\n");
        ble_gap_terminate(conn_handle, BLE_ERR_REM_USER_CONN_TERM);
        return 0;
    }

    /* Now we can safely send GET_BLOCK_SIZE */
    const struct peer *peer = peer_find(conn_handle);
    const struct peer_chr *ctrl_chr = peer_chr_find_uuid(peer,
                                       &oad_service_uuid.u,
                                       &oad_ctrl_uuid.u);
    uint8_t get_block_size = 0x01;
    int rc = ble_gattc_write_flat(conn_handle, ctrl_chr->chr.val_handle,
                                  &get_block_size, sizeof(get_block_size),
                                  NULL, NULL);
    if (rc != 0) {
        MODLOG_DFLT(ERROR, "Error: Failed to write GET_BLOCK_SIZE; rc=%d\n", rc);
    }
    g_oad_state = OAD_STATE_WAIT_BLOCK_SIZE;
    return 0;
}

static int oad_cccd_write_cb(uint16_t conn_handle,
                             const struct ble_gatt_error *error,
                             struct ble_gatt_attr *attr,
                             void *arg)
{
    const struct peer_dsc *img_dsc, *ctrl_dsc;
    const struct peer *peer = peer_find(conn_handle);
    ESP_LOGI(tag, "CCCD write complete status=%d handle=%d",
             error->status, attr ? attr->handle : 0);

    if (error->status != 0) {
        MODLOG_DFLT(ERROR, "CCCD write failed, aborting\n");
        ble_gap_terminate(conn_handle, BLE_ERR_REM_USER_CONN_TERM);
        return 0;
    }
    
    img_dsc = peer_dsc_find_uuid(peer, &oad_service_uuid.u, &oad_img_uuid.u,
                                 BLE_UUID16_DECLARE(BLE_GATT_DSC_CLT_CFG_UUID16));
    ctrl_dsc = peer_dsc_find_uuid(peer, &oad_service_uuid.u, &oad_ctrl_uuid.u,
                                  BLE_UUID16_DECLARE(BLE_GATT_DSC_CLT_CFG_UUID16));
    /* CCCD writes succeeded, now exchange MTU */
    int rc = ble_gattc_exchange_mtu(conn_handle, oad_on_mtu_exchanged, NULL);
    if (rc != 0) {
        MODLOG_DFLT(ERROR, "Error: Failed to request MTU exchange; rc=%d\n", rc);
    }
    return 0;
}

static int ble_oad_client_enable_notifications_2(uint16_t conn_handle,
                             const struct ble_gatt_error *error,
                             struct ble_gatt_attr *attr,
                             void *arg)
{
    const struct peer_dsc *dsc;
    uint8_t value[2];
    int rc;
    const struct peer *peer = peer_find(conn_handle);

    ESP_LOGI(tag,
             "CCCD write complete status=%d handle=%d",
             error->status,
             attr ? attr->handle : 0);
    
             
    dsc = peer_dsc_find_uuid(peer, &oad_service_uuid.u, &oad_ctrl_uuid.u,
                                  BLE_UUID16_DECLARE(BLE_GATT_DSC_CLT_CFG_UUID16));

    
    value[0] = 1;
    value[1] = 0;
    rc = ble_gattc_write_flat(peer->conn_handle, dsc->dsc.handle,
                              value, sizeof value, oad_cccd_write_cb, NULL);
    if (rc != 0) {
        MODLOG_DFLT(ERROR, "Error: Failed to subscribe to characteristic; "
                    "rc=%d\n", rc);
        goto err;
    }
    return 0;

    err:
        ble_gap_terminate(peer->conn_handle, BLE_ERR_REM_USER_CONN_TERM);
        return 0;
}
/**
 * Enables notifications for the OAD service.
 * If the peer does not support a required service, characteristic, or
 * descriptor, then the peer lied when it claimed support for the OAD
 * service!  When this happens, or if a GATT procedure fails,
 * this function immediately terminates the connection.
 */
static void ble_oad_client_enable_notifications(const struct peer *peer)
{    
    const struct peer_dsc *dsc;
    uint8_t value[2];
    int rc;
    dsc = peer_dsc_find_uuid(peer, &oad_service_uuid.u, &oad_img_uuid.u,
                                    BLE_UUID16_DECLARE(BLE_GATT_DSC_CLT_CFG_UUID16));

    if (dsc == NULL) {
        MODLOG_DFLT(ERROR, "Error: Peer doesn't support the OAD service\n");
        goto err;
    }

    value[0] = 1;
    value[1] = 0;
    rc = ble_gattc_write_flat(peer->conn_handle, dsc->dsc.handle,
                              value, sizeof value, ble_oad_client_enable_notifications_2, NULL);
    if (rc != 0) {
        MODLOG_DFLT(ERROR, "Error: Failed to subscribe to characteristic; "
                    "rc=%d\n", rc);
        goto err;
    }
    return;

    err:
        ble_gap_terminate(peer->conn_handle, BLE_ERR_REM_USER_CONN_TERM);
}

/**
 * Called when service discovery of the specified peer has completed.
 */
static void
blecent_on_disc_complete(const struct peer *peer, int status, void *arg)
{

    if (status != 0) {
        /* Service discovery failed.  Terminate the connection. */
        MODLOG_DFLT(ERROR, "Error: Service discovery failed; status=%d "
                    "conn_handle=%d\n", status, peer->conn_handle);
        ble_gap_terminate(peer->conn_handle, BLE_ERR_REM_USER_CONN_TERM);
        return;
    }

