Nafihahmd/esp32_nimble_oad_distributor/main/main.c
    /* Service discovery has completed successfully.  Now we have a complete
     * list of services, characteristics, and descriptors that the peer
     * supports.
     */
    MODLOG_DFLT(INFO, "Service discovery complete; status=%d "
                "conn_handle=%d\n", status, peer->conn_handle);

    /* Now perform three GATT procedures against the peer: read,
     * write, and subscribe to notifications for the ANS service.
     */
    // blecent_read_write_subscribe(peer);
    /* Enable notifications for the OAD service */
    ble_oad_client_enable_notifications(peer);
}
#endif  //MYNEWT_VAL(BLE_GATTC)

/**
 * Initiates the GAP general discovery procedure.
 */
static void
blecent_scan(void)
{
    uint8_t own_addr_type;
    struct ble_gap_disc_params disc_params = {0};
    int rc;

    /* Figure out address to use while advertising (no privacy for now) */
    rc = ble_hs_id_infer_auto(0, &own_addr_type);
    if (rc != 0) {
        MODLOG_DFLT(ERROR, "error determining address type; rc=%d\n", rc);
        return;
    }

    /* Tell the controller to filter duplicates; we don't want to process
     * repeated advertisements from the same device.
     */
    disc_params.filter_duplicates = 1;

    /**
     * Perform a passive scan.  I.e., don't send follow-up scan requests to
     * each advertiser.
     */
    disc_params.passive = 1;

    /* Use defaults for the rest of the parameters. */
    disc_params.itvl = 0;
    disc_params.window = 0;
    disc_params.filter_policy = 0;
    disc_params.limited = 0;

    ESP_LOGI(tag, "Initiating GAP discovery procedure");
    rc = ble_gap_disc(own_addr_type, BLE_HS_FOREVER, &disc_params,
                      blecent_gap_event, NULL);
    if (rc != 0) {
        MODLOG_DFLT(ERROR, "Error initiating GAP discovery procedure; rc=%d\n",
                    rc);
    }
}

/**
 * @brief Get Complete local name from advertisement data
 * 
 * @param data Advertisement data
 * @param data_len Advertisement data length
 * @param name Buffer to store the complete local name
 * @param name_size Size of the buffer to store the complete local name
 */
bool get_complete_local_name(const uint8_t *data,
                             uint8_t data_len,
                             char *name,
                             size_t name_size)
{
    uint8_t offset = 0;
    ESP_LOGD(tag, "Searching for Complete Local Name in advertisement data");

    while (offset < data_len) {

        uint8_t len = data[offset];

        if (len == 0) {
            break;
        }

        /* Ensure AD structure is within bounds */
        if ((offset + len) >= data_len) {
            ESP_LOGD(tag, "Advertisement data is corrupted");
            return false;
        }

        uint8_t ad_type = data[offset + 1];

        /* Complete Local Name */
        if (ad_type == 0x09) {
            ESP_LOGD(tag, "Complete Local Name found in advertisement data");

            uint8_t name_len = len - 1;

            if (name_len >= name_size) {
                name_len = name_size - 1;
            }

            memcpy(name,
                   &data[offset + 2],
                   name_len);

            name[name_len] = '\0';

            return true;
        }

        offset += len + 1;
    }

    return false;
}
/**
 * Indicates whether we should try to connect to the sender of the specified
 * advertisement.  The function returns a positive result if the device
 * advertises connectability and support for the Alert Notification service.
 */
#if CONFIG_EXAMPLE_EXTENDED_ADV
static int
ext_blecent_should_connect(const struct ble_gap_ext_disc_desc *disc)
{
    int offset = 0;
    int ad_struct_len = 0;
#if CONFIG_EXAMPLE_USE_CI_ADDRESS
    uint32_t *addr_offset;
#endif // CONFIG_EXAMPLE_USE_CI_ADDRESS
    uint8_t test_addr[6];
    uint32_t peer_addr[6];
    char local_name[32];

    memset(peer_addr, 0x0, sizeof peer_addr);

    if (disc->legacy_event_type != BLE_HCI_ADV_RPT_EVTYPE_ADV_IND &&
            disc->legacy_event_type != BLE_HCI_ADV_RPT_EVTYPE_DIR_IND) {
        return 0;
    }
    if (strlen(CONFIG_EXAMPLE_PEER_ADDR) && (strncmp(CONFIG_EXAMPLE_PEER_ADDR, "ADDR_ANY", strlen    ("ADDR_ANY")) != 0)) {
#if !CONFIG_EXAMPLE_USE_CI_ADDRESS
        ESP_LOGI(tag, "Peer address from menuconfig: %s", CONFIG_EXAMPLE_PEER_ADDR);
        /* Convert string to address */
        sscanf(CONFIG_EXAMPLE_PEER_ADDR, "%lx:%lx:%lx:%lx:%lx:%lx",
               &peer_addr[5], &peer_addr[4], &peer_addr[3],
               &peer_addr[2], &peer_addr[1], &peer_addr[0]);
#endif

        /* Conversion */
	for(int i=0; i<6; i++) {
	   test_addr[i] = (uint8_t )peer_addr[i];
        }

#if CONFIG_EXAMPLE_USE_CI_ADDRESS
	addr_offset = (uint32_t *)&test_addr[1];
        *addr_offset = atoi(CONFIG_EXAMPLE_PEER_ADDR);
        test_addr[5] = 0xC3;
        test_addr[0] = TEST_CI_ADDRESS_CHIP_OFFSET;
#endif
	if (memcmp(test_addr, disc->addr.val, sizeof(disc->addr.val)) != 0) {
	    return 0;
        }
    }

    
    /* Search for local name */        
    if (get_complete_local_name(disc->data, disc->length_data, local_name, sizeof(local_name))) {
        ESP_LOGI(tag, "Complete Local Name: %s", local_name);
    }

    if (strncmp(local_name, CONFIG_EXAMPLE_LOCAL_NAME, strlen(CONFIG_EXAMPLE_LOCAL_NAME)) == 0) {
        ESP_LOGI(tag, "Local name match target name: %s", CONFIG_EXAMPLE_LOCAL_NAME);
        return 1;
    }
    /* The device has to advertise support for the Alert Notification
    * service (0x1811).
    */
    // do {
    //     ad_struct_len = disc->data[offset];

    //     if (!ad_struct_len) {
    //         break;
    //     }

	// /* Search if ANS UUID is advertised */
    //     if (disc->data[offset] == 0x03 && disc->data[offset + 1] == 0x03) {
    //         if ( disc->data[offset + 2] == 0x18 && disc->data[offset + 3] == 0x11 ) {
    //             return 1;
    //         }
    //     }

    //     offset += ad_struct_len + 1;

    //  } while ( offset < disc->length_data );

    return 0;
}
#else
static int
blecent_should_connect(const struct ble_gap_disc_desc *disc)
{
    struct ble_hs_adv_fields fields;
    int rc;
    int i;
#if CONFIG_EXAMPLE_USE_CI_ADDRESS
    uint32_t *addr_offset;
#endif // CONFIG_EXAMPLE_USE_CI_ADDRESS
    uint8_t test_addr[6];
    uint32_t peer_addr[6];

    memset(peer_addr, 0x0, sizeof peer_addr);

    /* The device has to be advertising connectability. */
    if (disc->event_type != BLE_HCI_ADV_RPT_EVTYPE_ADV_IND &&
            disc->event_type != BLE_HCI_ADV_RPT_EVTYPE_DIR_IND) {

