Nafihahmd/esp32_nimble_oad_distributor/main/main.c
#if MYNEWT_VAL(BLE_POWER_CONTROL)
            blecent_power_control(event->connect.conn_handle);
#endif

#if MYNEWT_VAL(BLE_HCI_VS)
#if MYNEWT_VAL(BLE_POWER_CONTROL)
	    memset(&params, 0x0, sizeof(struct ble_gap_set_auto_pcl_params));
	    params.conn_handle = event->connect.conn_handle;
            rc = ble_gap_set_auto_pcl_param(&params);
            if (rc != 0) {
                MODLOG_DFLT(INFO, "Failed to send VSC  %x \n", rc);
                return 0;
            }
            else {
               MODLOG_DFLT(INFO, "Successfully issued VSC , rc = %d \n", rc);
	    }
#endif
#endif

#if CONFIG_EXAMPLE_ENCRYPTION
            /** Initiate security - It will perform
             * Pairing (Exchange keys)
             * Bonding (Store keys)
             * Encryption (Enable encryption)
             * Will invoke event BLE_GAP_EVENT_ENC_CHANGE
             **/
            rc = ble_gap_security_initiate(event->connect.conn_handle);
            if (rc != 0) {
                MODLOG_DFLT(INFO, "Security could not be initiated, rc = %d\n", rc);
                return ble_gap_terminate(event->connect.conn_handle,
                                         BLE_ERR_REM_USER_CONN_TERM);
            } else {
                MODLOG_DFLT(INFO, "Connection secured\n");
            }
#else
#if MYNEWT_VAL(BLE_GATTC)
            /* Perform service discovery */
            rc = peer_disc_all(event->connect.conn_handle,
                        blecent_on_disc_complete, NULL);
            if(rc != 0) {
                MODLOG_DFLT(ERROR, "Failed to discover services; rc=%d\n", rc);
                return 0;
            }
#endif
#endif
        } else {
            /* Connection attempt failed; resume scanning. */
            MODLOG_DFLT(ERROR, "Error: Connection failed; status=%d\n",
                        event->connect.status);
            blecent_scan();
        }

        return 0;

    case BLE_GAP_EVENT_DISCONNECT:
        /* Connection terminated. */
        MODLOG_DFLT(INFO, "disconnect; reason=%d ", event->disconnect.reason);
        print_conn_desc(&event->disconnect.conn);
        MODLOG_DFLT(INFO, "\n");

        /* Forget about peer. */
        peer_delete(event->disconnect.conn.conn_handle);

#if MYNEWT_VAL(BLE_EATT_CHAN_NUM) > 0
        /* Reset EATT config */
        bearers = 0;
        for (int i = 0; i < MYNEWT_VAL(BLE_EATT_CHAN_NUM); i++) {
            cids[i] = 0;
        }
#endif

        /* Resume scanning. */
        blecent_scan();
        return 0;

    case BLE_GAP_EVENT_DISC_COMPLETE:
        ESP_LOGI(tag, "Discovery complete; reason=%d\n",
                 event->disc_complete.reason);
        MODLOG_DFLT(INFO, "discovery complete; reason=%d\n",
                    event->disc_complete.reason);
        return 0;

    case BLE_GAP_EVENT_ENC_CHANGE:
        /* Encryption has been enabled or disabled for this connection. */
        MODLOG_DFLT(INFO, "encryption change event; status=%d ",
                    event->enc_change.status);
        rc = ble_gap_conn_find(event->enc_change.conn_handle, &desc);
        assert(rc == 0);
        print_conn_desc(&desc);
#if !MYNEWT_VAL(BLE_EATT_CHAN_NUM)
#if CONFIG_EXAMPLE_ENCRYPTION && MYNEWT_VAL(BLE_GATTC)
        /*** Go for service discovery after encryption has been successfully enabled ***/
        rc = peer_disc_all(event->enc_change.conn_handle,
                           blecent_on_disc_complete, NULL);
        if (rc != 0) {
            MODLOG_DFLT(ERROR, "Failed to discover services; rc=%d\n", rc);
            return 0;
        }
#endif
#endif
        return 0;

    case BLE_GAP_EVENT_NOTIFY_RX:
        /* Peer sent us a notification or indication. */
        uint8_t data[256];
        uint16_t len = OS_MBUF_PKTLEN(event->notify_rx.om);

        os_mbuf_copydata(event->notify_rx.om, 0, len, data);
        // MODLOG_DFLT(INFO, "received %s; conn_handle=%d attr_handle=%d "
        //             "attr_len=%d\n",
        //             event->notify_rx.indication ?
        //             "indication" :
        //             "notification",
        //             event->notify_rx.conn_handle,
        //             event->notify_rx.attr_handle,
        //             OS_MBUF_PKTLEN(event->notify_rx.om));
        // ESP_LOG_BUFFER_HEX(tag, data, len);

        if (event->notify_rx.attr_handle == 62) { // FFC5

            uint8_t cmd = data[0];

            switch (cmd) {

            case 0x01: // GET_BLOCK_SIZE response

                if (len >= 3) {

                    g_block_size = data[1] | (data[2] << 8);
                    uint32_t image_payload_size = g_block_size - 4;

                    g_total_blocks =
                        (g_image_size + image_payload_size - 1)
                        / image_payload_size;

                    ESP_LOGD(tag,
                        "BlockSize=%u Payload=%lu TotalBlocks=%lu",
                        g_block_size,
                        (unsigned long)image_payload_size,
                        (unsigned long)g_total_blocks);

                    send_image_identify(event->notify_rx.conn_handle);    // <-- write FFC1
                    g_oad_state = OAD_STATE_WAIT_IMAGE_ACCEPT;
                }
                break;

            case 0x04:

                if (len >= 2) {

                    uint8_t status = data[1];

                    if (status == 0x00) {

                        ESP_LOGI(tag,
                                "OAD Finish acknowledged");

                        g_oad_state = OAD_STATE_IDLE;
                    }
                    else {

                        ESP_LOGE(tag,
                                "OAD Finish failed status=0x%02X",
                                status);
                    }
                }
                break;

            case 0x12:
            {
                uint8_t status = data[1];

                if (status == 0x00) {
                    handle_block_request(event->notify_rx.conn_handle, data, len);
                }
                else if (status == 0x0E) {

